rottenpotatoes/hw4/app/controllers/movies_controller.rb

  def director
    @movie = Movie.find(params[:id])
    if @movie.director == nil or @movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]